brew "python@3.13"
brew "rust"
brew "go"
brew "ruby"
brew "swig"
brew "ninja"
brew "llvm"
brew "zig"
brew "hyperfine"
brew "lua"
brew "luajit"
brew "odin"
brew "elixir"
brew "chezscheme"
brew "mawk"
brew "gnucobol"
brew "vlang"
brew "dart-sdk"
cask "dotnet-sdk"
brew "julia"
brew "haskell-stack"